// Написать программу масштабирования фигуры





Console.WriteLine("Hello, World!");
