// Найти сумму чисел одномерного массива стоящих на нечетной позиции

// int[] array = { 12, 34, 5567, 45, 68, 4, 7, 7870, 34, 33235, 657, 48579, 80, 890, 9678, 463, 54 };
int[] array = { 1, 0, 3, 0, 5, 0, 7, 1, 9 };
int sum = 0;

for (int i = 0; i < array.Length; i++)
{
    if (i % 2 != 0)
    {
        sum += array[i];
    }
}

Console.WriteLine(sum);
