// Поиск квадрата числа Зал 2

// Console.WriteLine("Введите ваше число ");
// int number = Convert.ToInt32(Console.ReadLine());
// int number = int.Parse(Console.ReadLine());
// int square = (int)Math.Pow(number, 2);
// int square = number * number;
// Console.WriteLine(square);


// Задача 2:
/* Напишите программу, которая на вход принимает два числа и выдаёт,
 какое число большее, а какое меньшее.*/

// Console.WriteLine("Введите первое число: ");
// int one = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine("Введите второе число: ");
// int two = Convert.ToInt32(Console.ReadLine());

// if (one > two)
//     Console.WriteLine(one + " больше.");
// else
//     Console.WriteLine(two + " больше.");


// Задача 4:
/* Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.*/

// Console.WriteLine("Введите первое число: ");
// int one = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine("Введите второе число: ");
// int two = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine("Введите третье число: ");
// int three = Convert.ToInt32(Console.ReadLine());

// int max = one;

// if (one > max)
//     max = one;
// if (two > max)
//     max = two;
// if (three > max)
//     max = three;
// Console.WriteLine(max + " максимальное число.");


// Задача 6:
/* Напишите программу, которая на вход принимает число и выдаёт,
 является ли число чётным (делится ли оно на два без остатка).*/

// Console.Write("Введите ваше число: ");
// int n = Convert.ToInt32(Console.ReadLine());

// if (n % 2 == 0)
// {
//     Console.WriteLine(n + " является чётным.");
// }
// else
// {
//     Console.WriteLine(n + " является нечётным.");
// }


// Задача 8:
/* Напишите программу, которая на вход принимает число (N), 
а на выходе показывает все чётные числа от 1 до N. */

// Console.Write("Введите ваше число: ");
// int n = Convert.ToInt32(Console.ReadLine());
// int count = 1;

// while (count <= n)
// {
//     if (count % 2 == 0)
//     {
//         Console.WriteLine(count);
//         count += 2;
//     }
//     else
//     {
//         count += 1;
//     }
// }
