// Дано число. Проверить кратно ли оно 7 и 23

// Console.WriteLine("Введите число: ");
// int number = int.Parse(Console.ReadLine()!);

// if (number % 7 == 0)
//     {
//     if (number % 23 == 0)
//         Console.WriteLine(number + " кратно 7 и 23.");
//     else 
//         Console.WriteLine("Условие не выполнено.");


//     }
// else   
//     Console.WriteLine("Условие не выполнено.");


/* Определить номер четверти плоскости,
 в которой находится точка с координатами Х и У, причем X ≠ 0 и Y ≠ 0 */

// Console.WriteLine("Введите X: ");
// int x = int.Parse(Console.ReadLine()!);

// Console.WriteLine("Введите Y: ");
// int y = int.Parse(Console.ReadLine()!);


// if (x > 0 && y > 0)

//     Console.WriteLine("Первая четверть.");

// else if (x < 0 && y > 0)

//     Console.WriteLine("Вторая четверть.");

// else if (x < 0 && y < 0)

//     Console.WriteLine("Третья четверть.");

// else if (x > 0 && y < 0)

//     Console.WriteLine("Четвертая четверть.");

// else
//     Console.WriteLine("Ввели 0");

/* Программа проверяет
 пятизначное число на палиндромом.*/

Console.WriteLine("Введите пятизначное число.");

// string? num = Console.ReadLine();

// if (num[0] == num[4] && num[1] == num[3])

//     Console.WriteLine("Верно");

// else
//     Console.WriteLine("не Верно");
