// Таблица квадратов чисел до N

// Console.WriteLine("Введите число: ");
// int n = int.Parse(Console.ReadLine()!);
// int result = 0;
// for (int i = 1; i <= n; i++) 
// {
//     result = i * i;
//     Console.WriteLine($"Квадрат числа {i}  равен: {result}");
// }
    
    


// Найти сумму чисел от 1 до А

// Console.WriteLine("Введите число: ");
// int A = int.Parse(Console.ReadLine()!);
// int sum = 0;
// for (int i = 0; i <= A; i++)
// {
//     sum += i;
// }
    
// Console.WriteLine(sum);


// Возведите число А в натуральную степень B используя цикл

// Console.WriteLine("Введите число: ");
// int A = int.Parse(Console.ReadLine()!);

// Console.WriteLine("Введите число: ");
// int B = int.Parse(Console.ReadLine()!);

// int result = 1;
// for (int i = 1; i <= B; i++)
// { 
//     result *= A; 
// }
// Console.WriteLine(result);


// Определить количество цифр в числе

// Console.WriteLine("Введите число: ");
// int number = int.Parse(Console.ReadLine()!);

// int count = 0;

// while (number > 0)
// {
//     number = number / 10;
//     count++;
// }
// Console.WriteLine(count);


// 

