// Вывести квадрат числа

Console.WriteLine("Введите ваше число ");
int number = Convert.ToInt32(Console.ReadLine());
int square = (int)Math.Pow(number, 2);

Console.WriteLine(square);